# Redis 命令集

## SET

> Time complexity: O(1)

Set key to hold the string value. If key already holds a value, it is overwritten, regardless of its type. Any previous time to live associated with the key is discarded on successful SET operation.

```bash
set [key] [value] [options]
```

Note that SET will replace any existing value already stored into the key, in the case that the key already exists, even if the key is associated with a non-string value. So SET performs an assignment.

### Options

- EX seconds: Set the specified expire time, in seconds.
- PX milliseconds: Set the specified expire time, in milliseconds.
- NX: Only set the key if it does not already exist.
- XX: Only set the key if it already exist.

### Example

```bash
> set mykey newval nx
(nil)
> set mykey newval xx
"OK"
> SET anotherkey "will expire in a minute" EX 60
"OK"
```

## GET
 
> Time complexity: O(1)

Get the value of key. If the key does not exist the special value nil is returned. An error is returned if the value stored at key is not a string, because GET only handles string values.

```bash
GET [key]
```

### Example

```bash
> GET nonexisting
(nil)
> SET mykey "Hello"
"OK"
> GET mykey
"Hello"
redis> 
```

## INCR && DECR

Even if strings are the basic values of Redis, there are interesting operations you can perform with them. For instance, one is atomic increment:
